Repository: stanercelik/TesbeeApp
Catalog: lib/l10n/app_*.arb
Languages: tr

# homeScreenTitle
source: Home
tr: Ana Sayfa

# beadsScreenTitle
source: Beads
tr: Tesbihler

# settingsScreenTitle
source: Settings
tr: Ayarlar

source: Start Counter
tr: Saymaya Başla

source: Reset Counter
tr: Sıfırla

source: Add New Bead
tr: Yeni Tesbih Ekle

source: Edit Bead
tr: Tesbihi Düzenle

source: Delete Bead
tr: Tesbihi Sil

source: Bead Name
tr: Tesbih Adı

# beadCount
source: Count
tr: Sayı

# saveButton
source: Save
tr: Kaydet

# cancelButton
source: Cancel
tr: İptal

# deleteButton
source: Delete
tr: Sil

source: Theme Settings
tr: Tema Ayarları

source: Language Settings
tr: Dil Ayarları

source: Sound Settings
tr: Ses Ayarları

source: Vibration Settings
tr: Titreşim Ayarları

source: Dark Mode
tr: Karanlık Mod

source: Light Mode
tr: Aydınlık Mod

source: Color Picker
tr: Renk Seçici

source: Select Color
tr: Seç

# welcomeTitle
source: Welcome to TesBee
tr: TesBee'ye Hoşgeldiniz

# exploreApp
source: Explore the App
tr: Uygulamayı keşfet

source: Sign in with Email
tr: E-posta ile giriş yap

# noAccount
source: Don't have an account?
tr: Hesabın yok mu?

source: Sign Up
tr: Kaydol

# bottomNavBarDhikrs
source: Dhikrs
tr: Zikirler

# bottomNavBarBeads
source: Beads
tr: Tespihler

# bottomNavBarAIHoca
source: AI Hodja
tr: AI Hoca

# dhikrAlertTitle
source: Congratulations!
tr: Tebrikler!

# dhikrAlertContent
source: You have completed your dhikr. What would you like to do?
tr: Zikrinizi tamamladınız. Ne yapmak istersiniz?

# dhikrAlertRestartButton
source: Start Over
tr: Yeniden Başla

# dhikrAlertDeleteButton
source: Delete Dhikr
tr: Zikri Sil

# dhikrsScreenTitle
source: Dhikrs
tr: Zikirler

# dhikrSignInPrompt
source: Please sign in to access your dhikrs
tr: Zikirlerinize erişmek için lütfen giriş yapın

# dhikrSignInAction
source: Sign In
tr: Giriş Yap

# emptyDhikrListMessage
source: Your dhikr list is empty. Tap the + button in the top right corner to add your first dhikr!
tr: Zikir listeniz boş. Sağ üst köşedeki + düğmesine dokunarak ilk zikirlerinizi ekleyebilirsiniz!

# dhikrLimitReached
source: Limit Reached
tr: Limite Ulaşıldı

# dhikrLimitReachedText
source: You have reached the maximum number of dhikrs
tr: Maksimum zikir sayısına ulaştınız

# addDhikrTitle
source: Title
tr: Başlık

# addDhikrTitleHint
source: Enter dhikr title
tr: Zikir başlığını girin

# addDhikrTargetNum
source: Target Number
tr: Hedef Sayı

# addDhikrTargetNumHint
source: Enter target number
tr: Hedef sayıyı girin

# addDhikrPray
source: Prayer
tr: Dua

# addDhikrPrayHint
source: Enter prayer text
tr: Dua metnini girin

# addDhikrBeadsColor
source: Beads Color
tr: Tespih Rengi

# addDhikrStringColor
source: String Color
tr: İp Rengi

# addDhikrBackgroundColor
source: Background
tr: Arkaplan

# editDhikrButton
source: Edit Dhikr
tr: Zikri Düzenle

# addDhikrButton
source: Add Dhikr
tr: Zikir Ekle

# drawerTitle
source: Settings
tr: Ayarlar

# drawerChangeBeadsColor
source: Change Beads Color
tr: Tespih Rengini Değiştir

# drawerChangeStringColor
source: Change String Color
tr: İp Rengini Değiştir

# drawerVibration
source: Vibration
tr: Titreşim

# drawerSoundEffect
source: Sound Effect
tr: Ses Efekti

# drawerSignOut
source: Sign Out
tr: Çıkış Yap

# subhanallahString
source: Subhanallah
tr: Sübhanallah

# elhamdulillahString
source: Elhamdulillah
tr: Elhamdülillah

source: Congratulations!
tr: Tebrikler!

# dhikrCompletedCount
source: {count} dhikrs completed
tr: {count} zikri tamamladınız

# dhikrCountMessage33
source: Subhanallah 33
tr: Sübhanallah 33

# dhikrCountMessage66
source: Elhamdulillah 66
tr: Elhamdülillah 66

source: Sign up with Email
tr: E-posta ile Kayıt Ol

# enterEmailPassword
source: Enter your email and password
tr: E-posta ve şifrenizi girin

source: Create Account
tr: Hesap Oluştur

source: Email
tr: E-posta

source: Password
tr: Şifre

source: Error
tr: Hata

source: Success
tr: Başarılı

# accountCreated
source: Account created successfully
tr: Hesap başarıyla oluşturuldu

# emailAlreadyInUse
source: An account already exists with this email
tr: Bu e-posta ile zaten bir hesap oluşturulmuş

# unknownError
source: An unknown error occurred
tr: Bilinmeyen bir hata oluştu

# biometricAuthFailed
source: Biometric authentication failed or not supported
tr: Biyometrik kimlik doğrulama başarısız veya desteklenmiyor

source: Forgot Password?
tr: Şifrenizi mi unuttunuz?

source: By continuing
tr: Devam ederek

source: Privacy Policy
tr: Gizlilik Politikası

source: and
tr: ve

source: Terms and Conditions
tr: Kullanım Şartları

# youAccept
source: you accept our
tr: kabul etmiş olursunuz

source: Close
tr: Kapat

# emailLabel
source: Email
tr: E-posta

# passwordLabel
source: Password
tr: Şifre

# signInTitle
source: Sign in with Email
tr: E-posta ile giriş yap

# signInSubtitle
source: Enter your email and password to sign in
tr: E-posta ve şifreni girerek giriş yap

# signInButton
source: Sign In
tr: Giriş yap

# passwordResetEmailSent
source: Password reset email sent to {email}
tr: Şifre sıfırlama e-postası {email} adresine gönderildi

source: Send Reset Link
tr: Sıfırlama Bağlantısı Gönder

# aiHocaTitle
source: AI Hodja
tr: AI Hoca

source: Type your question...
tr: Sorunuzu yazın...

# errorMessage
source: Sorry, an error occurred. Please try again.
tr: Üzgünüm, bir hata oluştu. Lütfen tekrar deneyin.

source: Predefined Dhikrs
tr: Hazır Zikirler

# addDhikrTitleError
source: Please enter a title
tr: Lütfen bir başlık girin

# addDhikrTitleLongError
source: Title cannot be longer than 50 characters
tr: Başlık 50 karakterden uzun olamaz

# addDhikrPrayError
source: Prayer cannot be longer than 120 characters
tr: Dua 120 karakterden uzun olamaz

# addDhikrCountZeroError
source: Please enter a valid number greater than 0
tr: Lütfen 0'dan büyük geçerli bir sayı girin

# addDhikrCountTooBigError
source: Number cannot be greater than 9999
tr: Sayı 9999'dan büyük olamaz
